Tekla.Structures.Model.RebarLeg.OriginEnum
Enumerator for different leg origins.

Tekla.Structures.Model.RebarLeg.OriginEnum.NORMAL
The leg is from a face

Tekla.Structures.Model.RebarLeg.OriginEnum.HOOK
The leg is on a hook.

Tekla.Structures.Model.RebarLeg.OriginEnum.CRANK
The leg is on a crank.